### development Part # 1
  #### Terraform Format and Style 🖌`skipped`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/0e5fad24-6d9a-4ae7-9300-0e93ece38bc3/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_ecs_task_definition.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "main" {
      + arn             = (known after apply)
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "Cashews-task"
      + task_role_arn   = (known after apply)
    }

  # aws_cloudwatch_log_group.log-group will be created
  + resource "aws_cloudwatch_log_group" "log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "Cashews-development-logs"
      + retention_in_days = 90
      + tags_all          = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "Cashews-development-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.ecs-cluster will be created
  + resource "aws_ecs_cluster" "ecs-cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "Cashews-development-cluster"
      + tags_all           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.ecs-service will be created
  + resource "aws_ecs_service" "ecs-service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "Cashews-development-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "Cashews-development-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.hello_world will be created
  + resource "aws_ecs_service" "hello_world" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-world-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-world-app"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.ecs-task will be created
  + resource "aws_ecs_task_definition" "ecs-task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "Cashews-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_ecs_task_definition.hello_world will be created
  + resource "aws_ecs_task_definition" "hello_world" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 1024
                  + image        = "heroku/nodejs-hello-world"
                  + memory       = 2048
                  + name         = "hello-world-app"
                  + portMappings = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 3000
                        },
                    ]
                },
            ]
        )
      + cpu                      = "1024"
      + family                   = "hello-world-app"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_eip.gateway[0] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_eip.gateway[1] will be created
  + resource "aws_eip" "gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc                  = true
    }

  # aws_flow_log.default will be created
  + resource "aws_flow_log" "default" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.ecsTaskExecutionRole will be created
  + resource "aws_iam_role" "ecsTaskExecutionRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "Cashews-execution-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.example will be created
  + resource "aws_iam_role" "example" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc-fl-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.example will be created
  + resource "aws_iam_role_policy" "example" {
      + id     = (known after apply)
      + name   = "flow-log-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecsTaskExecutionRole_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "Cashews-execution-task-role"
    }

  # aws_internet_gateway.gateway will be created
  + resource "aws_internet_gateway" "gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_lb.application_load_balancer will be created
  + resource "aws_lb" "application_load_balancer" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = true
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "Cashews-development-alb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.hello_world will be created
  + resource "aws_lb_listener" "hello_world" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_target_group.hello_world will be created
  + resource "aws_lb_target_group" "hello_world" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "hw-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 300
          + matcher             = "200"
          + path                = "/v1/status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "Cashews-development-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 300
          + matcher             = "200"
          + path                = "/v1/healthcheck"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_nat_gateway.gateway[0] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_nat_gateway.gateway[1] will be created
  + resource "aws_nat_gateway" "gateway" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

  # aws_route.public will be created
  + resource "aws_route" "public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cashewhands_s3_bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.default will be created
  + resource "aws_s3_bucket_public_access_block" "default" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.hello_world_task will be created
  + resource "aws_security_group" "hello_world_task" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to ECS from VPC CIDR"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Deny"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow"
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "hw-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.load_balancer_sg will be created
  + resource "aws_security_group" "load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic to Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound access"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow https inbound access"
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow inbound access"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "ECS Service security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow outbound access"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow inbound access"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.100.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.32.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "Cashewhands"
          + "Project"       = "ECS-Deep-Dive"
          + "Purpose"       = "Further deploy ECS to AWS"
          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"
          + "Team"          = "Cashewhands"
          + "Terraform"     = "true"
        }
    }

Plan: 41 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # data.aws_ecs_task_definition.main will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ecs_task_definition" "main" {%0A      + arn             = (known after apply)%0A      + family          = (known after apply)%0A      + id              = (known after apply)%0A      + network_mode    = (known after apply)%0A      + revision        = (known after apply)%0A      + status          = (known after apply)%0A      + task_definition = "Cashews-task"%0A      + task_role_arn   = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_log_group.log-group will be created%0A  + resource "aws_cloudwatch_log_group" "log-group" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "Cashews-development-logs"%0A      + retention_in_days = 90%0A      + tags_all          = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A    }%0A%0A  # aws_default_security_group.default will be created%0A  + resource "aws_default_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.ecr will be created%0A  + resource "aws_ecr_repository" "ecr" {%0A      + arn                  = (known after apply)%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "IMMUTABLE"%0A      + name                 = "Cashews-development-ecr"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + encryption_configuration {%0A          + encryption_type = "KMS"%0A          + kms_key         = (known after apply)%0A        }%0A%0A      + image_scanning_configuration {%0A          + scan_on_push = true%0A        }%0A    }%0A%0A  # aws_ecs_cluster.ecs-cluster will be created%0A  + resource "aws_ecs_cluster" "ecs-cluster" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "Cashews-development-cluster"%0A      + tags_all           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # aws_ecs_service.ecs-service will be created%0A  + resource "aws_ecs_service" "ecs-service" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + force_new_deployment               = true%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "Cashews-development-ecs-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "Cashews-development-container"%0A          + container_port   = 8080%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_service.hello_world will be created%0A  + resource "aws_ecs_service" "hello_world" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 1%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "hello-world-service"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = {%0A          + "Backup"        = "false"%0A          + "Environment"   = "development"%0A          + "Product-Owner" = "Cashewhands"%0A          + "Project"       = "ECS-Deep-Dive"%0A          + "Purpose"       = "Further deploy ECS to AWS"%0A          + "Repo"          = "https://github.com/cashewhands/ecs-deep-dive"%0A          + "Team"          = "Cashewhands"%0A          + "Terraform"     = "true"%0A        }%0A      + task_definition                    = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "hello-world-app"%0A          + container_port   = 3000%0A          + target_group_arn = (known after apply)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = (known after apply)%0A          + subnets          = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.ecs-task will be created%0A  + resource "aws_ecs_task_definition" "ecs-task" {%0A      + arn                      = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + execution_role_arn       = (known after apply)%0A      + family                   = "Cashews-task"%0A      + id                       = (known afte
  ```
  </details>
  *Pusher: @cashewhands, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*